# SetDocDrpShadowData

```pascal
PROCEDURE SetDocDrpShadowData(
				bUseDropShadow : BOOLEAN;
				nUnits         : INTEGER;
				dOffset        : REAL;
				dBlurRadius    : REAL;
				dAngle         : REAL;
				nOpacity       : INTEGER;
				color          : LONGINT);
```

```python
def vs.SetDocDrpShadowData(bUseDropShadow, nUnits, dOffset, dBlurRadius, dAngle, nOpacity, color):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|bUseDropShadow|BOOLEAN|   |
|nUnits|INTEGER|   |
|dOffset|REAL|   |
|dBlurRadius|REAL|   |
|dAngle|REAL|   |
|nOpacity|INTEGER|   |
|color|LONGINT|   |

## Version
Availability: from Vectorworks 2017

## Category
* Document Attributes